In [2]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns

In [3]:
df = pd.read_csv('restaurants_data.csv')

In [4]:
df.head()

,Name,Cuisines,City,Rating,NumberOfReviews
0,Wakame - Riyadh,"\n\n Japanese, Asian\n ...",\n\n\n Riyadh\n ...,\n4.9\n,\n (\n ...
1,Morini Italian Restaurant - Jareed Hotel - Riyadh,"\n\n International, Italian...",\n\n\n Riyadh\n ...,Very Good,\n (\n ...
2,Wakame - Jeddah,"\n\n Chinese, Japanese\n ...",\n\n\n Jeddah\n ...,\n4.8\n,\n (\n ...
3,Il Baretto Italian Restaurant - KAFD - Riyadh,\n\n Italian\n ...,\n\n\n Riyadh\n ...,Very Good,\n (\n ...
4,Vidro Lounge - Riyadh,"\n\n Mediterranean, Middle ...",\n\n\n Riyadh\n ...,\n4.7\n,\n (\n ...

In [5]:
df.describe()

,Name,Cuisines,City,Rating,NumberOfReviews
count,1369,1369,1369,1369,1369
unique,1344,261,12,22,74
top,Lusin Armenian Restaurant - Khobar,"\n\n Cafe, Coffee & Tea, De...",\n\n\n Jeddah\n ...,Very Good,\n (\n ...
freq,2,173,461,523,46

# EDA

## Start with the 7-Dimnesions

### Reliability 

> Data Was taken from this [Welcome Saudi](https://welcomesaudi.com/restaurant?query=&page=1) for food and restuarnts 
reccomendations.
 
> we Webscraped the data from Welcome Saudi

### Timeness 
> Data was scraped wedensday 28/8/2024

### Consistency

> Some columns need cleaning which we will address down: e.g. some values have '\n' within the rows

### Relevance

> Data is Relavent to the questions we are asking!

### Uniqueness

> There exist some duplicates which we will be droping!

In [8]:
df[df.duplicated()]

,Name,Cuisines,City,Rating,NumberOfReviews
106,Morini Italian Restaurant - Jareed Hotel - Riyadh,"\n\n International, Italian...",\n\n\n Riyadh\n ...,Very Good,\n (\n ...
139,Wakame - Jeddah,"\n\n Chinese, Japanese\n ...",\n\n\n Jeddah\n ...,\n4.8\n,\n (\n ...
174,Il Baretto Italian Restaurant - KAFD - Riyadh,\n\n Italian\n ...,\n\n\n Riyadh\n ...,Very Good,\n (\n ...
195,Vidro Lounge - Riyadh,"\n\n Mediterranean, Middle ...",\n\n\n Riyadh\n ...,\n4.7\n,\n (\n ...
202,Tokyo Fine Dining Japanese - Restaurant - Riyadh,\n\n Japanese\n ...,\n\n\n Riyadh\n ...,Very Good,\n (\n ...
276,AOK Kitchen - KAFD - Riyadh,"\n\n Gluten Free Option, In...",\n\n\n Riyadh\n ...,Very Good,\n (\n ...
452,Swiss Butter - Sahara Mall - Riyadh,\n\n Steakhouse\n ...,\n\n\n Riyadh\n ...,Very Good,\n (\n ...
574,Lusin Armenian Restaurant - Riyadh,\n\n Armenian\n ...,\n\n\n Riyadh\n ...,Very Good,\n (\n ...
720,Swiss Butter - Jeddah,\n\n Steakhouse\n ...,\n\n\n Jeddah\n ...,Very Good,\n (\n ...
832,Early Club - Breakfast & Brunch,\n,\n\n\n Jeddah\n ...,Very Good,\n (\n ...

In [9]:
df.drop_duplicates(inplace = True)

### Completeness

> no NUll values in the data

In [12]:
df.isnull().sum()

Name               0
Cuisines           0
City               0
Rating             0
NumberOfReviews    0
dtype: int64

### Accuracy

> Some data types are not the same which should be addressed like the rating column whihc has two types: numerical and categorical. 

> we will address outliers once we finished the cleaning of the data

## Cleaning!

In [13]:
df.head()

,Name,Cuisines,City,Rating,NumberOfReviews
0,Wakame - Riyadh,"\n\n Japanese, Asian\n ...",\n\n\n Riyadh\n ...,\n4.9\n,\n (\n ...
1,Morini Italian Restaurant - Jareed Hotel - Riyadh,"\n\n International, Italian...",\n\n\n Riyadh\n ...,Very Good,\n (\n ...
2,Wakame - Jeddah,"\n\n Chinese, Japanese\n ...",\n\n\n Jeddah\n ...,\n4.8\n,\n (\n ...
3,Il Baretto Italian Restaurant - KAFD - Riyadh,\n\n Italian\n ...,\n\n\n Riyadh\n ...,Very Good,\n (\n ...
4,Vidro Lounge - Riyadh,"\n\n Mediterranean, Middle ...",\n\n\n Riyadh\n ...,\n4.7\n,\n (\n ...

In [29]:
df = df.apply(lambda x: x.str.replace('\n', '').replace('\t', ''))

In [30]:
df.head()

,Name,Cuisines,City,Rating,NumberOfReviews
0,Wakame - Riyadh,"Japanese, Asian ...",Riyadh,4.9,( ...
1,Morini Italian Restaurant - Jareed Hotel - Riyadh,"International, Italian ...",Riyadh,Very Good,( ...
2,Wakame - Jeddah,"Chinese, Japanese ...",Jeddah,4.8,( ...
3,Il Baretto Italian Restaurant - KAFD - Riyadh,Italian ...,Riyadh,Very Good,( ...
4,Vidro Lounge - Riyadh,"Mediterranean, Middle East...",Riyadh,4.7,( ...

In [34]:
df.dtypes

Name               object
Cuisines           object
City               object
Rating             object
NumberOfReviews    object
dtype: object

In [35]:
df.Cuisines.value_counts()

Cuisines
Cafe, Coffee & Tea, Desserts                                  173
International                                                 141
American                                                      121
Italian                                                        66
Indian                                                         54
                                                             ...
Cafe, Desserts, Coffee & Tea                                    1
French, International, Italian                                  1
Shwarma, Steakhouse                                             1
Armenian, American                                              1
American, Arabic, Italian                                       1
Name: count, Length: 261, dtype: int64